In [3]:
import pandas as pd
import numpy as np
import scipy.stats as stats
import matplotlib.pyplot as plt 
import math

In [5]:
df_bags = pd.read_csv("Bags.csv")
df_bags

    Machine 1  Machine 2
0        2.95       3.22
1        3.45       3.30
2        3.50       3.34
3        3.75       3.28
4        3.48       3.29
5        3.26       3.25
6        3.33       3.30
7        3.20       3.27
8        3.16       3.38
9        3.20       3.34
10       3.22       3.35
11       3.38       3.19
12       3.90       3.35
13       3.36       3.05
14       3.25       3.36
15       3.28       3.28
16       3.20       3.30
17       3.22       3.28
18       2.98       3.30
19       3.45       3.20
20       3.70       3.16
21       3.34       3.33
22       3.18        NaN
23       3.35        NaN
24       3.12        NaN
25        NaN        NaN

In [8]:
df_bags["Machine 1"].mean()

3.3284000000000002

In [9]:
df_bags["Machine 2"].mean()

3.278181818181818

In [14]:
df_bags_No_Na = df_bags.dropna()

In [15]:
df_bags_No_Na.describe()

       Machine 1  Machine 2
count  22.000000  22.000000
mean    3.343636   3.278182
std     0.229109   0.076820
min     2.950000   3.050000
25%     3.205000   3.255000
50%     3.305000   3.295000
75%     3.450000   3.337500
max     3.900000   3.380000

In [16]:
stats.ttest_ind(a = df_bags_No_Na["Machine 2"], b = df_bags_No_Na["Machine 1"])

Ttest_indResult(statistic=-1.270497174746086, pvalue=0.2109004913298526)